import Link from "next/link";

// ** Imoprt icons
import { HiOutlineFilter } from "react-icons/hi";
import AllProducts from "@/app/components/AllProducts";

const page = ({params}) => {

    return (
        <>
            <div className="breadcrumb breadcrumb-2 py-5 border-b border-slate-200">
                <div className="container">
                    <div>
                        <Link href={`/`} className="text-base text-slate-600 hover:text-primary">হোম</Link>
                        <Link href={`/privacy-policy`} className="text-base text-slate-900 hover:text-primary">প্রাইভেসি পলিসি</Link>
                    </div>
                </div>
            </div>

            <div className="container">
                <div className="privacy-policy mb-12">
                    <div className="heading border-b border-slate-200 py-4">
                        <h3 className="text-4xl/[48px] font-bold font-title text-slate-900">সততা স্টলের প্রাইভেসি পলিসি</h3>
                    </div>
                    <p className="text-lg text-slate-600 my-5">এই গোপনীয়তা নীতিটি তাদের &#10075;ব্যক্তিগতভাবে শনাক্তযোগ্য তথ্য&#10076; (PII) কীভাবে অনলাইনে ব্যবহার করা হচ্ছে তা নিয়ে যারা উদ্বিগ্ন তাদের আরও ভাল পরিষেবা দেওয়ার জন্য সংকলন করা হয়েছে। PII, ইউএস প্রাইভেসি আইন এবং তথ্য সুরক্ষায় ব্যবহৃত তথ্য, যেটি একক ব্যক্তিকে সনাক্ত করতে, যোগাযোগ করতে বা সনাক্ত করতে বা প্রেক্ষাপটে একজন ব্যক্তিকে শনাক্ত করতে নিজে থেকে বা অন্যান্য তথ্যের সাথে ব্যবহার করা যেতে পারে। আমাদের ওয়েবসাইট অনুসারে আমরা কীভাবে আপনার ব্যক্তিগতভাবে শনাক্তকরণযোগ্য তথ্য সংগ্রহ করি, ব্যবহার করি, রক্ষা করি বা অন্যথায় পরিচালনা করি সে সম্পর্কে পরিষ্কার বোঝার জন্য দয়া করে আমাদের গোপনীয়তা নীতিটি সাবধানে পড়ুন।</p>
                    <div className="policy mb-6">
                        <h3 className="text-2xl font-bold font-title text-slate-900 mb-4">যারা আমাদের ওয়েবসাইট বা ব্লগে যান তাদের কাছ থেকে আমরা কোন ব্যক্তিগত তথ্য সংগ্রহ করি?</h3>
                        <p className="text-lg text-slate-600">আমাদের সাইটে অর্ডার বা নিবন্ধন করার সময়, উপযুক্ত হিসাবে, আপনাকে আপনার নাম, ইমেল ঠিকানা, মেইলিং ঠিকানা, ফোন নম্বর বা আপনার অভিজ্ঞতার সাথে সাহায্য করার জন্য অন্যান্য বিশদ বিবরণ লিখতে বলা হতে পারে।</p>
                    </div>
                    <div className="policy mb-6">
                        <h3 className="text-2xl font-bold font-title text-slate-900 mb-4">আমরা কখন তথ্য সংগ্রহ করব?</h3>
                        <p className="text-lg text-slate-600">আপনি যখন কোনো নিউজলেটারে সাবস্ক্রাইব করেন, কোনো সমীক্ষায় সাড়া দেন, কোনো ফর্ম পূরণ করেন বা আমাদের সাইটে তথ্য প্রবেশ করেন তখন আমরা আপনার কাছ থেকে তথ্য সংগ্রহ করি।</p>
                    </div>
                    <div className="policy mb-6">
                        <h3 className="text-2xl font-bold font-title text-slate-900 mb-4">আমরা কিভাবে আপনার তথ্য ব্যবহার করবো?</h3>
                        <p className="text-lg text-slate-600">আপনি যখন নিবন্ধন করেন, কেনাকাটা করেন, আমাদের নিউজলেটারের জন্য সাইন আপ করেন, একটি সমীক্ষা বা বিপণন যোগাযোগে সাড়া দেন, ওয়েবসাইট সার্ফ করেন, বা নিম্নলিখিত উপায়ে নির্দিষ্ট অন্যান্য সাইট বৈশিষ্ট্যগুলি ব্যবহার করেন তখন আমরা আপনার কাছ থেকে সংগ্রহ করা তথ্য ব্যবহার করতে পারি:</p>
                        <p className="text-lg text-slate-600 my-4">ব্যবহারকারীর অভিজ্ঞতাকে ব্যক্তিগতকৃত করতে এবং আমাদেরকে আপনার সবচেয়ে আগ্রহী বিষয়বস্তু এবং পণ্যের অফারগুলি সরবরাহ করার অনুমতি দিতে আপনাকে আরও ভাল পরিবেশন করার জন্য আমাদের ওয়েবসাইট উন্নত করতে <br/> একটি প্রতিযোগিতা, প্রচার, জরিপ বা অন্যান্য সাইট বৈশিষ্ট্য পরিচালনা করতে</p>
                        <ul className="list-stl">
                            <li className="text-lg text-slate-600 mb-4">ব্যবহারকারীর অভিজ্ঞতাকে ব্যক্তিগতকৃত করতে এবং আমাদেরকে আপনার সবচেয়ে আগ্রহী বিষয়বস্তু এবং পণ্যের অফারগুলি সরবরাহ করার অনুমতি দিতে</li>
                            <li className="text-lg text-slate-600 mb-4">আপনাকে আরও ভাল পরিবেশন করার জন্য আমাদের ওয়েবসাইট উন্নত করতে</li>
                            <li className="text-lg text-slate-600">একটি প্রতিযোগিতা, প্রচার, জরিপ বা অন্যান্য সাইট বৈশিষ্ট্য পরিচালনা করতে</li>
                        </ul>
                    </div>
                    <div className="policy mb-6">
                        <h3 className="text-2xl font-bold font-title text-slate-900 mb-4">কিভাবে আমরা পরিদর্শক তথ্য রক্ষা করবেন?</h3>
                        <ul className="list-stl">
                            <li className="text-lg text-slate-600 mb-4">আমরা দুর্বলতা স্ক্যানিং এবং/অথবা PCI মান স্ক্যানিং ব্যবহার করি না৷ আমরা নিয়মিত ম্যালওয়্যার স্ক্যানিং ব্যবহার করি৷</li>
                            <li className="text-lg text-slate-600 mb-4">আমরা একটি SSL শংসাপত্র ব্যবহার করি না</li>
                            <li className="text-lg text-slate-600">আমরা একটি SSL প্রয়োজন নেই. কারণ, আমরা শুধুমাত্র অনুমোদিত পণ্য, নিবন্ধ এবং তথ্য প্রদান করি</li>
                        </ul>
                    </div>
                    <div className="policy mb-6">
                        <h3 className="text-2xl font-bold font-title text-slate-900 mb-4">আমরা কি &#10075;কুকিজ&#10076; ব্যবহার করি?</h3>
                        <p className="text-lg text-slate-600">হ্যাঁ, কিন্তু আমরা ট্র্যাকিং উদ্দেশ্যে কুকিজ ব্যবহার করি না। আপনি প্রতিবার কুকি পাঠানোর সময় আপনার কম্পিউটার আপনাকে সতর্ক করার জন্য চয়ন করতে পারেন, অথবা আপনি সমস্ত কুকি বন্ধ করতে বেছে নিতে পারেন৷ আপনি আপনার ব্রাউজার (যেমন ইন্টারনেট এক্সপ্লোরার) সেটিংসের মাধ্যমে এটি করেন। প্রতিটি ব্রাউজার একটু আলাদা, তাই আপনার কুকি পরিবর্তন করার সঠিক উপায় শিখতে আপনার ব্রাউজারের সহায়তা মেনু দেখুন।</p>
                        <p className="text-lg text-slate-600 my-4">ব্যবহারকারীরা তাদের ব্রাউজারে কুকিজ নিষ্ক্রিয় করলে: আপনি কুকিজ নিষ্ক্রিয় করলে, কিছু বৈশিষ্ট্য অক্ষম করা হবে। এটি এমন কিছু বৈশিষ্ট্য বন্ধ করে দেবে যা আপনার সাইটের অভিজ্ঞতাকে আরও দক্ষ করে তোলে এবং আমাদের কিছু পরিষেবা সঠিকভাবে কাজ করবে না</p>
                        <p className="text-lg text-slate-600 my-4">যাইহোক, আপনি এখনও আমাদের ওয়েবসাইট ব্রাউজ করতে পারেন.</p>
                    </div>
                </div>
            </div>


        </>
    )
}

export default page;