"use client";
import { useState } from "react";
import QAItem from "./elements/QAItem";

const data = [
  {
    title: "অর্ডার",
    desc: [
      {
        ques: "কিভাবে অর্ডার করবো?",
        ans: "আপনি সাইট ব্রাউজ করতে পারেন বা আপনার পছন্দের পণ্যগুলি খুঁজে পেতে আমাদের সার্চ ইঞ্জিন ব্যবহার করতে পারেন৷ তারপরে আপনি সেগুলিকে আপনার শপিং ব্যাগে যুক্ত করতে পারেন এবং প্লেস অর্ডারে ক্লিক করতে পারেন। আপনি আমাদের আপনার ঠিকানা জানান, একটি প্রসবের সময় নির্বাচন করুন - এবং ভয়েলা, আপনার কাজ শেষ৷ একজন সততা স্টোরের প্রতিনিধি তারপর আপনার অর্ডার সরাসরি আপনার বাড়িতে বা অফিসে পৌঁছে দেবেন৷",
      },
      {
        ques: "অর্ডার সম্পন্ন হতে কত ‍দিন সময় লাগে?",
        ans: "অর্ডার প্লেস করার ২ থেকে ৩ ঘন্টার মধ্যে অর্ডার কনফার্ম হবে, কনফার্ম হওয়ার পর ১৬ থেকে ২৪ ঘন্টার মধ্যে প্রডাক্ট শিপমেন্টে পাঠনো হবে, ২ থেকে ৩ দিনের মধ্যে প্রডাক্ট ডেলিভারি পাবেন৷",
      },
    ],
  },
  {
    title: "পেমেন্ট ",
    desc: [
      {
        ques: "কিভাবে অর্ডার করবো?",
        ans: "আপনি সাইট ব্রাউজ করতে পারেন বা আপনার পছন্দের পণ্যগুলি খুঁজে পেতে আমাদের সার্চ ইঞ্জিন ব্যবহার করতে পারেন৷ তারপরে আপনি সেগুলিকে আপনার শপিং ব্যাগে যুক্ত করতে পারেন এবং প্লেস অর্ডারে ক্লিক করতে পারেন। আপনি আমাদের আপনার ঠিকানা জানান, একটি প্রসবের সময় নির্বাচন করুন - এবং ভয়েলা, আপনার কাজ শেষ৷ একজন সততা স্টোরের প্রতিনিধি তারপর আপনার অর্ডার সরাসরি আপনার বাড়িতে বা অফিসে পৌঁছে দেবেন৷",
      },
      {
        ques: "অর্ডার সম্পন্ন হতে কত ‍দিন সময় লাগে?",
        ans: "অর্ডার প্লেস করার ২ থেকে ৩ ঘন্টার মধ্যে অর্ডার কনফার্ম হবে, কনফার্ম হওয়ার পর ১৬ থেকে ২৪ ঘন্টার মধ্যে প্রডাক্ট শিপমেন্টে পাঠনো হবে, ২ থেকে ৩ দিনের মধ্যে প্রডাক্ট ডেলিভারি পাবেন৷",
      },
    ],
  },
  {
    title: "ডেলিভারি",
    desc: [
      {
        ques: "কিভাবে অর্ডার করবো?",
        ans: "আপনি সাইট ব্রাউজ করতে পারেন বা আপনার পছন্দের পণ্যগুলি খুঁজে পেতে আমাদের সার্চ ইঞ্জিন ব্যবহার করতে পারেন৷ তারপরে আপনি সেগুলিকে আপনার শপিং ব্যাগে যুক্ত করতে পারেন এবং প্লেস অর্ডারে ক্লিক করতে পারেন। আপনি আমাদের আপনার ঠিকানা জানান, একটি প্রসবের সময় নির্বাচন করুন - এবং ভয়েলা, আপনার কাজ শেষ৷ একজন সততা স্টোরের প্রতিনিধি তারপর আপনার অর্ডার সরাসরি আপনার বাড়িতে বা অফিসে পৌঁছে দেবেন৷",
      },
      {
        ques: "অর্ডার সম্পন্ন হতে কত ‍দিন সময় লাগে?",
        ans: "অর্ডার প্লেস করার ২ থেকে ৩ ঘন্টার মধ্যে অর্ডার কনফার্ম হবে, কনফার্ম হওয়ার পর ১৬ থেকে ২৪ ঘন্টার মধ্যে প্রডাক্ট শিপমেন্টে পাঠনো হবে, ২ থেকে ৩ দিনের মধ্যে প্রডাক্ট ডেলিভারি পাবেন৷",
      },
    ],
  },
  {
    title: "রিটার্ন পলিসি",
    desc: [
      {
        ques: "কিভাবে অর্ডার করবো?",
        ans: "আপনি সাইট ব্রাউজ করতে পারেন বা আপনার পছন্দের পণ্যগুলি খুঁজে পেতে আমাদের সার্চ ইঞ্জিন ব্যবহার করতে পারেন৷ তারপরে আপনি সেগুলিকে আপনার শপিং ব্যাগে যুক্ত করতে পারেন এবং প্লেস অর্ডারে ক্লিক করতে পারেন। আপনি আমাদের আপনার ঠিকানা জানান, একটি প্রসবের সময় নির্বাচন করুন - এবং ভয়েলা, আপনার কাজ শেষ৷ একজন সততা স্টোরের প্রতিনিধি তারপর আপনার অর্ডার সরাসরি আপনার বাড়িতে বা অফিসে পৌঁছে দেবেন৷",
      },
      {
        ques: "অর্ডার সম্পন্ন হতে কত ‍দিন সময় লাগে?",
        ans: "অর্ডার প্লেস করার ২ থেকে ৩ ঘন্টার মধ্যে অর্ডার কনফার্ম হবে, কনফার্ম হওয়ার পর ১৬ থেকে ২৪ ঘন্টার মধ্যে প্রডাক্ট শিপমেন্টে পাঠনো হবে, ২ থেকে ৩ দিনের মধ্যে প্রডাক্ট ডেলিভারি পাবেন৷",
      },
    ],
  },
  {
    title: "ট্রামস এন্ড কন্ডিশন",
    desc: [
      {
        ques: "কিভাবে অর্ডার করবো?",
        ans: "আপনি সাইট ব্রাউজ করতে পারেন বা আপনার পছন্দের পণ্যগুলি খুঁজে পেতে আমাদের সার্চ ইঞ্জিন ব্যবহার করতে পারেন৷ তারপরে আপনি সেগুলিকে আপনার শপিং ব্যাগে যুক্ত করতে পারেন এবং প্লেস অর্ডারে ক্লিক করতে পারেন। আপনি আমাদের আপনার ঠিকানা জানান, একটি প্রসবের সময় নির্বাচন করুন - এবং ভয়েলা, আপনার কাজ শেষ৷ একজন সততা স্টোরের প্রতিনিধি তারপর আপনার অর্ডার সরাসরি আপনার বাড়িতে বা অফিসে পৌঁছে দেবেন৷",
      },
      {
        ques: "অর্ডার সম্পন্ন হতে কত ‍দিন সময় লাগে?",
        ans: "অর্ডার প্লেস করার ২ থেকে ৩ ঘন্টার মধ্যে অর্ডার কনফার্ম হবে, কনফার্ম হওয়ার পর ১৬ থেকে ২৪ ঘন্টার মধ্যে প্রডাক্ট শিপমেন্টে পাঠনো হবে, ২ থেকে ৩ দিনের মধ্যে প্রডাক্ট ডেলিভারি পাবেন৷",
      },
    ],
  },
];

export default function QNAItems({ isDashboard }) {
  const [open, setOpen] = useState(0);

  const toggleOpen = (index) => {
    if (open === index) {
      setOpen(null);
    }

    setOpen(index);
  };
  return (
    <div className="qna-wpr">
      {data?.map((item, index) => (
        <QAItem
          item={{ ...item, index }}
          key={index}
          open={open === index}
          toggleOpen={toggleOpen}
        />
      ))}
    </div>
  );
}
